wellrun/hc32f460/hc32f460_sdk/驱动库及样例/hc32f46x_ddl/example/adc/adc_09_sa_sb_awd_interrupt/source/main.c
/* ADC2 channel sampling time.      ADC2_CH0  ADC2_CH5 */
#define ADC2_SA_CHANNEL_SAMPLE_TIME { 0x60,    0x50 }

/* ADC2 channel sampling time.      ADC2_CH2  ADC2_CH3  ADC2_CH4  ADC2_CH7 */
#define ADC2_SB_CHANNEL_SAMPLE_TIME { 0x60,    0x50,     0x60,     0x50 }

/* AWD range definition. */
#define AWD_LOWER_1                 (33u)
#define AWD_UPPER_1                 (666u)

/* AWD interrupt type selection for this application. */
#define AWD_INT_CHCMP               (1u)
#define AWD_INT_SEQCMP              (2u)
#define ADC1_AWD_INT_TYPE           AWD_INT_CHCMP
#define ADC2_AWD_INT_TYPE           AWD_INT_SEQCMP

/* Interrupt flags definitions. */
#define ADC1_SA_IRQ_BIT             (1ul << 0u)
#define ADC1_SB_IRQ_BIT             (1ul << 1u)
#define ADC1_CHCMP_IRQ_BIT          (1ul << 2u)
#define ADC1_SEQCMP_IRQ_BIT         (1ul << 3u)

#define ADC2_SA_IRQ_BIT             (1ul << 4u)
#define ADC2_SB_IRQ_BIT             (1ul << 5u)
#define ADC2_CHCMP_IRQ_BIT          (1ul << 6u)
#define ADC2_SEQCMP_IRQ_BIT         (1ul << 7u)

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
static void AdcConfig(void);
static void AdcClockConfig(void);
static void AdcInitConfig(void);
static void AdcChannelConfig(void);
static void AdcTriggerConfig(void);
static void AdcIrqConfig(void);
static void AdcIrqRegister(stc_irq_regi_conf_t *pstcCfg, uint32_t u32Priority);

static void AdcSetChannelPinMode(M4_ADC_TypeDef *ADCx,
                                 uint32_t u32Channel,
                                 en_pin_mode_t enMode);
static void AdcSetPinMode(uint8_t u8AdcPin, en_pin_mode_t enMode);

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/
static uint16_t m_au16Adc1Value[ADC1_CH_COUNT];
static uint16_t m_au16Adc2Value[ADC2_CH_COUNT];

uint32_t m_u32AdcIrqFlag = 0u;

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief  Main function.
 **
 ** \param  None.
 **
 ** \retval int32_t return value, if needed.
 **
 ******************************************************************************/
int32_t main(void)
{
    /* Default clock is MRC(8MHz) */

    /* Config ADCs. */
    AdcConfig();

    /* Config UART for printing. Baud rate 115200. */
    Ddl_UartInit();

    /***************** Configuration end, application start **************/

    while (1u)
    {
        /*
         * PB7 falling edge triggers ADC1 sequence A.
         * ADC1 sequence A ending triggers ADC1 sequence B.
         * ADC1 sequence B ending triggers ADC2 sequence A.
         * ADC2 sequence A ending triggers ADC2 sequence B.
         */

        /* The software startup is always valid. */
        // ADC_StartConvert(M4_ADC1);

        /* Check ADCs. */
        if (m_u32AdcIrqFlag & ADC1_SA_IRQ_BIT)
        {
            m_u32AdcIrqFlag &= ~ADC1_SA_IRQ_BIT;
            printf("\nADC1 SA interrupt.");
            // Do something.
        }
        if (m_u32AdcIrqFlag & ADC1_SB_IRQ_BIT)
        {
            m_u32AdcIrqFlag &= ~ADC1_SB_IRQ_BIT;
            printf("\nADC1 SB interrupt.");
            // Do something.
        }
#if (ADC1_AWD_INT_TYPE == AWD_INT_CHCMP)
        if (m_u32AdcIrqFlag & ADC1_CHCMP_IRQ_BIT)
        {
            m_u32AdcIrqFlag &= ~ADC1_CHCMP_IRQ_BIT;
            printf("\nADC1 AWD channel interrupt.");
            // Do something.
        }
#else
        if (m_u32AdcIrqFlag & ADC1_SEQCMP_IRQ_BIT)
        {
            m_u32AdcIrqFlag &= ~ADC1_SEQCMP_IRQ_BIT;
            printf("\nADC1 AWD sequence interrupt.");
            // Do something.
        }
#endif

        if (m_u32AdcIrqFlag & ADC2_SA_IRQ_BIT)
        {
            m_u32AdcIrqFlag &= ~ADC2_SA_IRQ_BIT;
            printf("\nADC2 SA interrupt.");
            // Do something.
        }
        if (m_u32AdcIrqFlag & ADC2_SB_IRQ_BIT)
        {
            m_u32AdcIrqFlag &= ~ADC2_SB_IRQ_BIT;
            printf("\nADC2 SB interrupt.");
            // Do something.
        }
#if (ADC2_AWD_INT_TYPE == AWD_INT_CHCMP)
        if (m_u32AdcIrqFlag & ADC2_CHCMP_IRQ_BIT)
        {
            m_u32AdcIrqFlag &= ~ADC2_CHCMP_IRQ_BIT;
            printf("\nADC2 AWD channel interrupt.");
            // Do something.
        }
#else
        if (m_u32AdcIrqFlag & ADC2_SEQCMP_IRQ_BIT)
        {
            m_u32AdcIrqFlag &= ~ADC2_SEQCMP_IRQ_BIT;
            printf("\nADC2 AWD sequence interrupt.");
            // Do something.
        }
#endif
    }
}

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/
/**
 *******************************************************************************
 ** \brief  ADC configuration, including clock configuration, initial configuration
 **         and channel configuration, trigger source configuration and interrupt
 **         configuration.
 **
 ** \param  None.
 **
 ** \retval None.
 **
 ******************************************************************************/
static void AdcConfig(void)
{
    AdcClockConfig();
    AdcInitConfig();
    AdcChannelConfig();
    AdcTriggerConfig();
    AdcIrqConfig();
}

/**
 *******************************************************************************
 ** \brief  ADC clock configuration.
 **
 ** \note   1) ADCLK max frequency is 60MHz.
 **         2) If PCLK2 and PCLK4 are selected as the ADC clock,
 **            the following conditions must be met:
 **            a. ADCLK(PCLK2) max 60MHz;
 **            b. PCLK4 : ADCLK = 1:1, 2:1, 4:1, 8:1, 1:2, 1:4
 **
 ******************************************************************************/
static void AdcClockConfig(void)
{
#if (ADC_CLK == ADC_CLK_PCLK)
    stc_clk_sysclk_cfg_t stcSysclkCfg;

    /* Set bus clock division, depends on the system clock frequency. */
    stcSysclkCfg.enHclkDiv  = ClkSysclkDiv1;  // Max 168MHz
    stcSysclkCfg.enExclkDiv = ClkSysclkDiv2;  // Max 84MHz
    stcSysclkCfg.enPclk0Div = ClkSysclkDiv1;  // Max 168MHz
    stcSysclkCfg.enPclk1Div = ClkSysclkDiv2;  // Max 84MHz
    stcSysclkCfg.enPclk2Div = ClkSysclkDiv4;  // Max 60MHz
    stcSysclkCfg.enPclk3Div = ClkSysclkDiv4;  // Max 42MHz
    stcSysclkCfg.enPclk4Div = ClkSysclkDiv2;  // Max 84MHz.
    CLK_SysClkConfig(&stcSysclkCfg);
    CLK_SetPeriClkSource(ClkPeriSrcPclk);

#elif (ADC_CLK == ADC_CLK_MPLLQ)
    stc_clk_xtal_cfg_t stcXtalCfg;
    stc_clk_mpll_cfg_t stcMpllCfg;

