wellrun/hc32f460/hc32f460_sdk/驱动库及样例/hc32f46x_ddl/example/adc/adc_09_sa_sb_awd_interrupt/source/main.c
    /* ADC1 sequence A scan ends to trigger ADC1 sequence B. */
    stcTrgCfg.u8Sequence = AdcSequence_B;
    stcTrgCfg.enTrgSel   = AdcTrgsel_TRGX1;
    stcTrgCfg.enInTrg1   = EVT_ADC1_EOCA;
    ADC_ConfigTriggerSrc(M4_ADC1, &stcTrgCfg);
    ADC_TriggerSrcCmd(M4_ADC1, AdcSequence_B, Enable);

    /* ADC1 sequence B scan ends to trigger ADC2 sequence A. */
    stcTrgCfg.u8Sequence = AdcSequence_A;
    stcTrgCfg.enTrgSel   = AdcTrgsel_TRGX0;
    stcTrgCfg.enInTrg0   = EVT_ADC1_EOCB;
    ADC_ConfigTriggerSrc(M4_ADC2, &stcTrgCfg);
    ADC_TriggerSrcCmd(M4_ADC2, AdcSequence_A, Enable);

    /* ADC2 sequence A scan ends to trigger ADC2 sequence B. */
    stcTrgCfg.u8Sequence = AdcSequence_B;
    stcTrgCfg.enTrgSel   = AdcTrgsel_TRGX1;
    stcTrgCfg.enInTrg1   = EVT_ADC2_EOCA;
    ADC_ConfigTriggerSrc(M4_ADC2, &stcTrgCfg);
    ADC_TriggerSrcCmd(M4_ADC2, AdcSequence_B, Enable);
}

/**
 *******************************************************************************
 ** \brief  ADC interrupt configuration.
 **
 ** \note   1) ADC NVIC number: [Int000_IRQn, Int031_IRQn]
 **                             [Int116_IRQn, Int121_IRQn]
 **                             [Int142_IRQn]
 **
 **         2) IT IS NOT recommended to enable CHCMP interrupt and SEQCMP
 **            interrupt at the same time.
 **
 ******************************************************************************/
static void AdcIrqConfig(void)
{
    stc_irq_regi_conf_t stcAdcIrqCfg;

    /* Config ADC1 interrupts */
    stcAdcIrqCfg.enIntSrc    = INT_ADC1_EOCA;
    stcAdcIrqCfg.enIRQn      = Int010_IRQn;
    stcAdcIrqCfg.pfnCallback = ADC1A_IrqHandler;
    AdcIrqRegister(&stcAdcIrqCfg, DDL_IRQ_PRIORITY_03);

    stcAdcIrqCfg.enIntSrc    = INT_ADC1_EOCB;
    stcAdcIrqCfg.enIRQn      = Int011_IRQn;
    stcAdcIrqCfg.pfnCallback = ADC1B_IrqHandler;
    AdcIrqRegister(&stcAdcIrqCfg, DDL_IRQ_PRIORITY_04);

#if (ADC1_AWD_INT_TYPE == AWD_INT_CHCMP)
    stcAdcIrqCfg.enIntSrc    = INT_ADC1_CHCMP;
    stcAdcIrqCfg.enIRQn      = Int012_IRQn;
    stcAdcIrqCfg.pfnCallback = ADC1ChCmp_IrqHandler;
    AdcIrqRegister(&stcAdcIrqCfg, DDL_IRQ_PRIORITY_05);
#else
    stcAdcIrqCfg.enIntSrc    = INT_ADC1_SEQCMP;
    stcAdcIrqCfg.enIRQn      = Int013_IRQn;
    stcAdcIrqCfg.pfnCallback = ADC1SeqCmp_IrqHandler;
    AdcIrqRegister(&stcAdcIrqCfg, DDL_IRQ_PRIORITY_06);
#endif
    /* Config ADC2 interrupts */
    stcAdcIrqCfg.enIntSrc    = INT_ADC2_EOCA;
    stcAdcIrqCfg.enIRQn      = Int116_IRQn;
    stcAdcIrqCfg.pfnCallback = ADC2A_IrqHandler;
    AdcIrqRegister(&stcAdcIrqCfg, DDL_IRQ_PRIORITY_07);

    stcAdcIrqCfg.enIntSrc    = INT_ADC2_EOCB;
    stcAdcIrqCfg.enIRQn      = Int117_IRQn;
    stcAdcIrqCfg.pfnCallback = ADC2B_IrqHandler;
    AdcIrqRegister(&stcAdcIrqCfg, DDL_IRQ_PRIORITY_08);

#if (ADC2_AWD_INT_TYPE == AWD_INT_CHCMP)
    stcAdcIrqCfg.enIntSrc    = INT_ADC2_CHCMP;
    stcAdcIrqCfg.enIRQn      = Int118_IRQn;
    stcAdcIrqCfg.pfnCallback = ADC2ChCmp_IrqHandler;
    AdcIrqRegister(&stcAdcIrqCfg, DDL_IRQ_PRIORITY_09);
#else
    stcAdcIrqCfg.enIntSrc    = INT_ADC2_SEQCMP;
    stcAdcIrqCfg.enIRQn      = Int119_IRQn;
    stcAdcIrqCfg.pfnCallback = ADC2SeqCmp_IrqHandler;
    AdcIrqRegister(&stcAdcIrqCfg, DDL_IRQ_PRIORITY_10);
#endif
}

static void AdcIrqRegister(stc_irq_regi_conf_t *pstcCfg, uint32_t u32Priority)
{
    int16_t s16Vnum = pstcCfg->enIRQn;

    if (((s16Vnum >= Int000_IRQn) && (s16Vnum <= Int031_IRQn)) ||
        ((s16Vnum >= Int116_IRQn) && (s16Vnum <= Int120_IRQn)))
    {
        if (Ok != enIrqRegistration(pstcCfg))
        {
            return;
        }
    }
    else if (Int142_IRQn == s16Vnum)
    {
        enShareIrqEnable(pstcCfg->enIntSrc);
    }
    else
    {
        return;
    }
    NVIC_ClearPendingIRQ(pstcCfg->enIRQn);
    NVIC_SetPriority(pstcCfg->enIRQn, u32Priority);
    NVIC_EnableIRQ(pstcCfg->enIRQn);
}

/**
 *******************************************************************************
 ** \brief  Config the pin which is mapping the channel to analog or digit mode.
 **
 ******************************************************************************/
static void AdcSetChannelPinMode(M4_ADC_TypeDef *ADCx,
                                 uint32_t u32Channel,
                                 en_pin_mode_t enMode)
{
    uint8_t u8ChIndex;
#if (ADC_CH_REMAP)
    uint8_t u8AdcPin;
#else
    uint8_t u8ChOffset = 0u;
#endif

    if ((NULL == ADCx) || (0u == u32Channel))
    {
        return;
    }

    if (M4_ADC1 == ADCx)
    {
        u32Channel &= ADC1_PIN_MASK_ALL;
    }
    else
    {
        u32Channel &= ADC2_PIN_MASK_ALL;
#if (!ADC_CH_REMAP)
        u8ChOffset = 4u;
#endif
    }

    u8ChIndex = 0u;
    while (0u != u32Channel)
    {
        if (u32Channel & 0x1ul)
        {
#if (ADC_CH_REMAP)
            u8AdcPin = ADC_GetChannelPinNum(ADCx, u8ChIndex);
            AdcSetPinMode(u8AdcPin, enMode);
#else
            AdcSetPinMode((u8ChIndex + u8ChOffset), enMode);
#endif
        }

        u32Channel >>= 1u;
        u8ChIndex++;
    }
}

/**
 *******************************************************************************
 ** \brief  Set an ADC pin as analog input mode or digit mode.
 **
 ******************************************************************************/
static void AdcSetPinMode(uint8_t u8AdcPin, en_pin_mode_t enMode)
{
    en_port_t enPort;
    en_pin_t enPin;
    stc_port_init_t stcPortInit;

    MEM_ZERO_STRUCT(stcPortInit);
    stcPortInit.enPinMode = enMode;
    stcPortInit.enPullUp = Disable;

    switch (u8AdcPin)
    {
    case ADC1_IN0:
        enPort = PortA;
        enPin  = Pin00;
        break;

    case ADC1_IN1:
        enPort = PortA;
        enPin  = Pin01;
        break;

    case ADC1_IN2:
        enPort = PortA;
        enPin  = Pin02;
        break;

    case ADC1_IN3:
        enPort = PortA;
        enPin  = Pin03;
        break;

    case ADC12_IN4:
        enPort = PortA;
        enPin  = Pin04;
        break;

    case ADC12_IN5:
        enPort = PortA;
        enPin  = Pin05;
        break;

