wellrun/hc32f460/hc32f460_sdk/驱动库及样例/hc32f46x_ddl/example/adc/adc_09_sa_sb_awd_interrupt/source/main.c
    case ADC12_IN6:
        enPort = PortA;
        enPin  = Pin06;
        break;

    case ADC12_IN7:
        enPort = PortA;
        enPin  = Pin07;
        break;

    case ADC12_IN8:
        enPort = PortB;
        enPin  = Pin00;
        break;

    case ADC12_IN9:
        enPort = PortB;
        enPin  = Pin01;
        break;

    case ADC12_IN10:
        enPort = PortC;
        enPin  = Pin00;
        break;

    case ADC12_IN11:
        enPort = PortC;
        enPin  = Pin01;
        break;

    case ADC1_IN12:
        enPort = PortC;
        enPin  = Pin02;
        break;

    case ADC1_IN13:
        enPort = PortC;
        enPin  = Pin03;
        break;

    case ADC1_IN14:
        enPort = PortC;
        enPin  = Pin04;
        break;

    case ADC1_IN15:
        enPort = PortC;
        enPin  = Pin05;
        break;

    default:
        return;
    }

    PORT_Init(enPort, enPin, &stcPortInit);
}

/**
 *******************************************************************************
 ** \brief IRQ callbacks.
 **
 ******************************************************************************/
void ADC1A_IrqHandler(void)
{
    if (Set == ADC_GetConvFlag(M4_ADC1, AdcSequence_A))
    {
        ADC_GetData(M4_ADC1, m_au16Adc1Value);
        ADC_ClrConvFlag(M4_ADC1, AdcSequence_A);
        m_u32AdcIrqFlag |= ADC1_SA_IRQ_BIT;
    }
}

void ADC1B_IrqHandler(void)
{
    if (Set == ADC_GetConvFlag(M4_ADC1, AdcSequence_B))
    {
        ADC_GetData(M4_ADC1, m_au16Adc1Value);
        ADC_ClrConvFlag(M4_ADC1, AdcSequence_B);
        m_u32AdcIrqFlag |= ADC1_SB_IRQ_BIT;
    }
}

void ADC1ChCmp_IrqHandler(void)
{
    uint32_t u32AwdOkCh;

    u32AwdOkCh = ADC_GetAwdFlag(M4_ADC1);

    if (0u != u32AwdOkCh)
    {
        m_u32AdcIrqFlag |= ADC1_CHCMP_IRQ_BIT;
    }

    if (ADC1_AWD_CH0 & u32AwdOkCh)
    {
        ADC_ClrAwdChFlag(M4_ADC1, ADC1_AWD_CH0);
        // TODO: YOUR CODE
    }

    if (ADC1_AWD_CH1 & u32AwdOkCh)
    {
        ADC_ClrAwdChFlag(M4_ADC1, ADC1_AWD_CH1);
        // TODO: YOUR CODE
    }

    if (ADC1_AWD_CH2 & u32AwdOkCh)
    {
        ADC_ClrAwdChFlag(M4_ADC1, ADC1_AWD_CH2);
        // TODO: YOUR CODE
    }
}

void ADC1SeqCmp_IrqHandler(void)
{
    uint32_t u32AwdOkCh;

    u32AwdOkCh = ADC_GetAwdFlag(M4_ADC1);

    if (0u != u32AwdOkCh)
    {
        m_u32AdcIrqFlag |= ADC1_SEQCMP_IRQ_BIT;
    }

    if (ADC1_SA_AWD_CHANNEL == (ADC1_SA_AWD_CHANNEL & u32AwdOkCh))
    {
        ADC_ClrAwdChFlag(M4_ADC1, ADC1_SA_AWD_CHANNEL);
        // TODO: YOUR CODE
    }

    if (ADC1_SB_AWD_CHANNEL == (ADC1_SB_AWD_CHANNEL & u32AwdOkCh))
    {
        ADC_ClrAwdChFlag(M4_ADC1, ADC1_SB_AWD_CHANNEL);
        // TODO: YOUR CODE
    }
}

void ADC2A_IrqHandler(void)
{
    if (Set == ADC_GetConvFlag(M4_ADC2, AdcSequence_A))
    {
        ADC_GetData(M4_ADC2, m_au16Adc2Value);
        ADC_ClrConvFlag(M4_ADC2, AdcSequence_A);
        m_u32AdcIrqFlag |= ADC2_SA_IRQ_BIT;
    }
}

void ADC2B_IrqHandler(void)
{
    if (Set == ADC_GetConvFlag(M4_ADC2, AdcSequence_B))
    {
        ADC_GetData(M4_ADC2, m_au16Adc2Value);
        ADC_ClrConvFlag(M4_ADC2, AdcSequence_B);
        m_u32AdcIrqFlag |= ADC2_SB_IRQ_BIT;
    }
}

void ADC2ChCmp_IrqHandler(void)
{
    uint32_t u32AwdOkCh;

    u32AwdOkCh = ADC_GetAwdFlag(M4_ADC2);

    if (0u != u32AwdOkCh)
    {
        m_u32AdcIrqFlag |= ADC2_CHCMP_IRQ_BIT;
    }

    if (ADC2_AWD_CH0 & u32AwdOkCh)
    {
        ADC_ClrAwdChFlag(M4_ADC2, ADC2_AWD_CH0);
        // TODO: YOUR CODE
    }

    if (ADC2_AWD_CH1 & u32AwdOkCh)
    {
        ADC_ClrAwdChFlag(M4_ADC2, ADC2_AWD_CH1);
        // TODO: YOUR CODE
    }

    if (ADC2_AWD_CH2 & u32AwdOkCh)
    {
        ADC_ClrAwdChFlag(M4_ADC2, ADC2_AWD_CH2);
        // TODO: YOUR CODE
    }
}

void ADC2SeqCmp_IrqHandler(void)
{
    uint32_t u32AwdOkCh;

    u32AwdOkCh = ADC_GetAwdFlag(M4_ADC2);

    if (0u != u32AwdOkCh)
    {
        m_u32AdcIrqFlag |= ADC2_SEQCMP_IRQ_BIT;
    }

    if (ADC2_SA_AWD_CHANNEL == (ADC2_SA_AWD_CHANNEL & u32AwdOkCh))
    {
        ADC_ClrAwdChFlag(M4_ADC2, ADC2_SA_AWD_CHANNEL);
        // TODO: YOUR CODE
    }

    if (ADC2_SB_AWD_CHANNEL == (ADC2_SB_AWD_CHANNEL & u32AwdOkCh))
    {
        ADC_ClrAwdChFlag(M4_ADC2, ADC2_SB_AWD_CHANNEL);
        // TODO: YOUR CODE
    }
}

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
